IDEA StatiCa Open Model
CrossSectionFactory.FillShapeT Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 T shape - massive concrete shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillShapeT(
	CrossSectionParameter css,
	double b,
	double h,
	double hf,
	double bw
)
Public Shared Sub FillShapeT (
	css As CrossSectionParameter,
	b As Double,
	h As Double,
	hf As Double,
	bw As Double
)
public:
static void FillShapeT(
	CrossSectionParameter^ css,
	double b,
	double h,
	double hf,
	double bw
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
b
Type: System.Double
Width of shape
h
Type: System.Double
Height of shape
hf
Type: System.Double
Top flange width
bw
Type: System.Double
Wall width
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace